'use client';

import React from 'react';
import { FAQ, PriceSection, RequestContainer } from '@/components/common';

export default function elementary() {
  return (
    <div>
      <PriceSection prices={prices} />
      <RequestContainer />
      memories <br />
      <FAQ questions={questions} />
    </div>
  );
}

const prices = {
  month: {
    price: 14500,
    crossedPrice: 16000,
    entranceFee: 2000,
  },
  year: {
    price: 14500,
    crossedPrice: 160000,
    entranceFee: 2000,
  },
};

const questions = [
  {
    title: 'Який рівень знань отримують діти?',
    text: 'Учні отримують академічні знання за державними стандартами, в поєднанні з авторськими методиками Taucer.',
  },
  {
    title: 'Які іноземні мови вивчають учні?',
    text: 'Діти вивчають 2 іноземні мови з першого класу: англійську та другу іноземну мову на вибір (польська / французька / німецька). \n Англійська мова передбачає уроки, speaking club-и та дозвілля з носіями',
  },
  { title: 'Яка кількість дітей у класах?', text: 'До 10 дітей в класі.' },
  {
    title: 'Хто навчає дітей?',
    text: 'Дипломовані спеціалісти, які люблять дітей, постійно навчаються та вдосконалюють свої навички.',
  },
  {
    title: 'Чи безпечно у вас?',
    text: 'Ми маємо цілодобову охорону та постійне відеоспостереження. Заїзд на територію Taucer можливий лише з дозволу адміністрації та після проходження поста охорони.',
  },
  {
    title: 'Які дії під час повітряної тривоги?',
    text: 'Під час тривоги діти, разом із вчителями, перебувають в укритті, яке обладнане всім необхідним для комфортного продовження навчального процесу, дозвілля та ігор.',
  },
  {
    title: 'Яке харчування?',
    text: 'Учні харчуються 5 разів на день стравами, що готують наші професійні кухарі. Батьки самостійно обирають раціон дитини на день у застосунку School Today.  Якщо в дитини є особливості в харчуванні, ми коригуємо меню відповідно до індивідуальних потреб ',
  },
];
